Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_bf.h
/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN27 */
#define IFX_EDSADC_ACCEN0_EN27_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN27 */
#define IFX_EDSADC_ACCEN0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN27 */
#define IFX_EDSADC_ACCEN0_EN27_OFF (27u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN28 */
#define IFX_EDSADC_ACCEN0_EN28_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN28 */
#define IFX_EDSADC_ACCEN0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN28 */
#define IFX_EDSADC_ACCEN0_EN28_OFF (28u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN29 */
#define IFX_EDSADC_ACCEN0_EN29_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN29 */
#define IFX_EDSADC_ACCEN0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN29 */
#define IFX_EDSADC_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN30 */
#define IFX_EDSADC_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN30 */
#define IFX_EDSADC_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN30 */
#define IFX_EDSADC_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN31 */
#define IFX_EDSADC_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN31 */
#define IFX_EDSADC_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCEN0_Bits.EN31 */
#define IFX_EDSADC_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.DITRIM */
#define IFX_EDSADC_GLOBCFG_DITRIM_LEN (3u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.DITRIM */
#define IFX_EDSADC_GLOBCFG_DITRIM_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.DITRIM */
#define IFX_EDSADC_GLOBCFG_DITRIM_OFF (8u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.USC */
#define IFX_EDSADC_GLOBCFG_USC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.USC */
#define IFX_EDSADC_GLOBCFG_USC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.USC */
#define IFX_EDSADC_GLOBCFG_USC_OFF (12u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EDSADC_GLOBCFG_SUPLEV_LEN (2u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EDSADC_GLOBCFG_SUPLEV_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.SUPLEV */
#define IFX_EDSADC_GLOBCFG_SUPLEV_OFF (13u)

/** \brief Length for Ifx_EDSADC_GLOBCFG_Bits.CPWC */
#define IFX_EDSADC_GLOBCFG_CPWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBCFG_Bits.CPWC */
#define IFX_EDSADC_GLOBCFG_CPWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBCFG_Bits.CPWC */
#define IFX_EDSADC_GLOBCFG_CPWC_OFF (15u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN0 */
#define IFX_EDSADC_GLOBRC_CHRUN0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN0 */
#define IFX_EDSADC_GLOBRC_CHRUN0_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN0 */
#define IFX_EDSADC_GLOBRC_CHRUN0_OFF (0u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN1 */
#define IFX_EDSADC_GLOBRC_CHRUN1_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN1 */
#define IFX_EDSADC_GLOBRC_CHRUN1_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN1 */
#define IFX_EDSADC_GLOBRC_CHRUN1_OFF (1u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN2 */
#define IFX_EDSADC_GLOBRC_CHRUN2_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN2 */
#define IFX_EDSADC_GLOBRC_CHRUN2_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN2 */
#define IFX_EDSADC_GLOBRC_CHRUN2_OFF (2u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN3 */
#define IFX_EDSADC_GLOBRC_CHRUN3_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN3 */
#define IFX_EDSADC_GLOBRC_CHRUN3_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN3 */
#define IFX_EDSADC_GLOBRC_CHRUN3_OFF (3u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN4 */
#define IFX_EDSADC_GLOBRC_CHRUN4_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN4 */
#define IFX_EDSADC_GLOBRC_CHRUN4_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN4 */
#define IFX_EDSADC_GLOBRC_CHRUN4_OFF (4u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN5 */
#define IFX_EDSADC_GLOBRC_CHRUN5_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN5 */
#define IFX_EDSADC_GLOBRC_CHRUN5_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN5 */
#define IFX_EDSADC_GLOBRC_CHRUN5_OFF (5u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN6 */
#define IFX_EDSADC_GLOBRC_CHRUN6_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN6 */
#define IFX_EDSADC_GLOBRC_CHRUN6_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN6 */
#define IFX_EDSADC_GLOBRC_CHRUN6_OFF (6u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN7 */
#define IFX_EDSADC_GLOBRC_CHRUN7_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN7 */
#define IFX_EDSADC_GLOBRC_CHRUN7_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN7 */
#define IFX_EDSADC_GLOBRC_CHRUN7_OFF (7u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN8 */
#define IFX_EDSADC_GLOBRC_CHRUN8_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN8 */
#define IFX_EDSADC_GLOBRC_CHRUN8_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN8 */
#define IFX_EDSADC_GLOBRC_CHRUN8_OFF (8u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN9 */
#define IFX_EDSADC_GLOBRC_CHRUN9_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN9 */
#define IFX_EDSADC_GLOBRC_CHRUN9_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN9 */
#define IFX_EDSADC_GLOBRC_CHRUN9_OFF (9u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN10 */
#define IFX_EDSADC_GLOBRC_CHRUN10_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN10 */
#define IFX_EDSADC_GLOBRC_CHRUN10_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN10 */
#define IFX_EDSADC_GLOBRC_CHRUN10_OFF (10u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN11 */
#define IFX_EDSADC_GLOBRC_CHRUN11_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN11 */
#define IFX_EDSADC_GLOBRC_CHRUN11_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN11 */
#define IFX_EDSADC_GLOBRC_CHRUN11_OFF (11u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN12 */
#define IFX_EDSADC_GLOBRC_CHRUN12_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN12 */
#define IFX_EDSADC_GLOBRC_CHRUN12_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN12 */
#define IFX_EDSADC_GLOBRC_CHRUN12_OFF (12u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CHRUN13 */
#define IFX_EDSADC_GLOBRC_CHRUN13_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CHRUN13 */
#define IFX_EDSADC_GLOBRC_CHRUN13_MSK (0x1u)

