Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEdsadc_bf.h
/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CHRUN13 */
#define IFX_EDSADC_GLOBRC_CHRUN13_OFF (13u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN0 */
#define IFX_EDSADC_GLOBRC_MRUN0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN0 */
#define IFX_EDSADC_GLOBRC_MRUN0_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN0 */
#define IFX_EDSADC_GLOBRC_MRUN0_OFF (16u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN1 */
#define IFX_EDSADC_GLOBRC_MRUN1_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN1 */
#define IFX_EDSADC_GLOBRC_MRUN1_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN1 */
#define IFX_EDSADC_GLOBRC_MRUN1_OFF (17u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN2 */
#define IFX_EDSADC_GLOBRC_MRUN2_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN2 */
#define IFX_EDSADC_GLOBRC_MRUN2_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN2 */
#define IFX_EDSADC_GLOBRC_MRUN2_OFF (18u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN3 */
#define IFX_EDSADC_GLOBRC_MRUN3_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN3 */
#define IFX_EDSADC_GLOBRC_MRUN3_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN3 */
#define IFX_EDSADC_GLOBRC_MRUN3_OFF (19u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN4 */
#define IFX_EDSADC_GLOBRC_MRUN4_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN4 */
#define IFX_EDSADC_GLOBRC_MRUN4_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN4 */
#define IFX_EDSADC_GLOBRC_MRUN4_OFF (20u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN5 */
#define IFX_EDSADC_GLOBRC_MRUN5_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN5 */
#define IFX_EDSADC_GLOBRC_MRUN5_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN5 */
#define IFX_EDSADC_GLOBRC_MRUN5_OFF (21u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN6 */
#define IFX_EDSADC_GLOBRC_MRUN6_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN6 */
#define IFX_EDSADC_GLOBRC_MRUN6_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN6 */
#define IFX_EDSADC_GLOBRC_MRUN6_OFF (22u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN7 */
#define IFX_EDSADC_GLOBRC_MRUN7_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN7 */
#define IFX_EDSADC_GLOBRC_MRUN7_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN7 */
#define IFX_EDSADC_GLOBRC_MRUN7_OFF (23u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN8 */
#define IFX_EDSADC_GLOBRC_MRUN8_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN8 */
#define IFX_EDSADC_GLOBRC_MRUN8_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN8 */
#define IFX_EDSADC_GLOBRC_MRUN8_OFF (24u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN9 */
#define IFX_EDSADC_GLOBRC_MRUN9_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN9 */
#define IFX_EDSADC_GLOBRC_MRUN9_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN9 */
#define IFX_EDSADC_GLOBRC_MRUN9_OFF (25u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN10 */
#define IFX_EDSADC_GLOBRC_MRUN10_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN10 */
#define IFX_EDSADC_GLOBRC_MRUN10_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN10 */
#define IFX_EDSADC_GLOBRC_MRUN10_OFF (26u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN11 */
#define IFX_EDSADC_GLOBRC_MRUN11_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN11 */
#define IFX_EDSADC_GLOBRC_MRUN11_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN11 */
#define IFX_EDSADC_GLOBRC_MRUN11_OFF (27u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN12 */
#define IFX_EDSADC_GLOBRC_MRUN12_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN12 */
#define IFX_EDSADC_GLOBRC_MRUN12_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN12 */
#define IFX_EDSADC_GLOBRC_MRUN12_OFF (28u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.MRUN13 */
#define IFX_EDSADC_GLOBRC_MRUN13_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.MRUN13 */
#define IFX_EDSADC_GLOBRC_MRUN13_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.MRUN13 */
#define IFX_EDSADC_GLOBRC_MRUN13_OFF (29u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_OFF (0u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_OFF (1u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_OFF (2u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_OFF (3u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_OFF (4u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_OFF (5u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_MSK (0x1u)

